# GetLayoutRule Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetLayoutRule Method
RebarUpdateCurvesData Class See Also
---
Gets the layout rule for this bar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public RebarLayoutRule GetLayoutRule()
```

Visual Basic
---
```text
Public Function GetLayoutRule As RebarLayoutRule
```

Visual C++
---
```text
public:
RebarLayoutRule GetLayoutRule()
```

# ### Return Value
Returns the layout rule for this bar.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace